01-introduction.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-02-03 Mon 17:59 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introduction</title>
<meta name="author" content="modula t. worm" />
<meta name="generator" content="Org Mode" />
<link type='text/css' rel='stylesheet' href='css.css' />
</head>
<body>
<div id="preamble" class="status">
<nav>
  <ol class="bar">
    <li value="0"><a href="index.html">Contents</a></li>
    <li><a href="01-introduction.html">Introduction</a></li>
    <li><a href="02-getting-started.html">Getting Started</a></li>
    <li><a href="03-make-a-sound.html">Make a Sound</a></li>
    <li><a href="04-further-soundmaking.html">Further Soundmaking</a></li>
    <li><a href="05-sampling.html">Sampling</a></li>
    <li><a href="06-sequencing.html">Sequencing</a></li>
    <li><a href="07-effects.html">Effects</a></li>
    <li><a href="08-architecture.html">Architecture</a></li>
    <li><a href="09-other-libraries.html">Other Libraries</a></li>
  </ol>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Introduction</h1>
</header><div id="outline-container-org111df15" class="outline-2">
<h2 id="org111df15">About this tutorial</h2>
<div class="outline-text-2" id="text-org111df15">
<p>
This tutorial is written as an introduction and overview of the <a href="https://github.com/byulparan/cl-collider">cl-collider</a> library for Common Lisp. The format is based on the <a href="http://doc.sccode.org/Tutorials/Getting-Started/00-Getting-Started-With-SC.html">official SuperCollider tutorial</a> and will cover similar topics, though it isn't a direct translation.
</p>

<p>
cl-collider is a library for Common Lisp written by Park Sungmin and contributors as an interface to the <a href="https://supercollider.github.io/">SuperCollider</a> ("SC") sound server. cl-collider is just one of many such interfaces that exist; other interfaces have already been written in languages such as Clojure (<a href="https://overtone.github.io/">Overtone</a>), Javascript (<a href="https://github.com/crucialfelix/supercolliderjs">supercollider.js</a>), etc. SuperCollider's official interface is through its own language, sclang, which is provided with the SuperCollider package itself. The SuperCollider package also provides an integrated development environment ("SCIDE") which aims to make writing SuperCollider code in sclang easier.
</p>

<p>
This tutorial will only be using the sound server provided by the SuperCollider package and will not utilize the language or the IDE. Therefore, this tutorial does not require previous experience with SuperCollider. Knowledge of Common Lisp is required, as teaching it is out of the scope of this document, but the next chapter does give basic information on how to set up a basic Lisp environment to work with cl-collider. Instead of SCIDE, we will be assuming use of Emacs as a text editor and development environment, but it is possible to use other editors such as Vim to write and interact with the Lisp process instead if you choose, and most of the information contained in this tutorial should be applicable regardless of the editor in use.
</p>
</div>
</div>
<div id="outline-container-org6015410" class="outline-2">
<h2 id="org6015410">Format of this tutorial</h2>
<div class="outline-text-2" id="text-org6015410">
<p>
In this tutorial, you will see code snippets in monospace, with syntax highlighting, like so:
</p>

<div class="org-src-container">
<pre class="src src-lisp"><span class="org-rainbow-delimiters-depth-1">(</span><span class="org-keyword">defun</span><span class="org-whitespace-space"> </span><span class="org-function-name">foo</span><span class="org-whitespace-space"> </span><span class="org-rainbow-delimiters-depth-2">(</span>a<span class="org-whitespace-space"> </span>b<span class="org-rainbow-delimiters-depth-2">)</span>
<span class="org-whitespace-space">  </span><span class="org-rainbow-delimiters-depth-2">(</span>+<span class="org-whitespace-space"> </span>a<span class="org-whitespace-space"> </span>b<span class="org-rainbow-delimiters-depth-2">)</span><span class="org-rainbow-delimiters-depth-1">)</span>
</pre>
</div>

<p>
Keywords and other code that appear inline in the text will also be in monospace, like so: <code>defun</code>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2017-06-10 Sat 22:39. Updated: 2025-02-03 Mon 17:59.</p>
</div>
</body>
</html>
